---
kind: type
id: T:Autodesk.Revit.DB.RoofBase
source: html/cbb87773-3ac9-3afe-2bde-49a59a2740cc.htm
---
# Autodesk.Revit.DB.RoofBase

Represents all kinds of Roofs.

## Syntax (C#)
```csharp
public class RoofBase : HostObject
```

## Remarks
The RoofBase object represents all kinds of roof in Revit.